#Thu Aug 07 10:12:05 PDT 2014
XJ022.S=No se ha podido definir el flujo\: ''{0}''.
XN017.S=Se ha alcanzado el final del flujo antes de tiempo al leer el flujo especificado por el par\u00E1metro \#{0}. Los datos restantes esperados por el servidor se han rellenado con 0x0.
XJ115.S=No se ha podido abrir resultSet con la capacidad de retenci\u00F3n solicitada {0}.
XJ04C.S=El lote CallableStatement no puede contener par\u00E1metros de salida.
XN013.S=Orientaci\u00F3n de desplazamiento no v\u00E1lida.
XJ079.S=La longitud ''{0}'' especificada excede  el tama\u00F1o del BLOB/CLOB.
XJ111.S=El nombre de tabla ajena no puede ser nulo
XJ208.S=Fallo del lote no at\u00F3mico. El lote se ha enviado pero al menos se ha producido una excepci\u00F3n en un miembro individual del lote. Utilice getNextException() para recuperar las excepciones para los elementos por lotes espec\u00EDficos.
XJ204.S=No se ha podido abrir el juego de resultados con la capacidad de retenci\u00F3n solicitada {0}.
XJ071.S=Se ha transferido un argumento de longitud negativo ''{0}'' en un m\u00E9todo BLOB o CLOB.
XJ200.S=Se ha excedido el n\u00FAmero m\u00E1ximo de secciones {0}
22005.S.6=Tipo SQL Java no reconocido {0}.
22005.S.5=Tipo JDBC no v\u00E1lido para el par\u00E1metro {0}.
22005.S.4=Tipo JDBC no reconocido. Tipo\: {0}, columnCount\: {1}, columnIndex\: {2}.
22005.S.3=La cadena Unicode no se puede convertir a la cadena Ebcdic
22005.S.2=El convertidor de caracteres necesario no est\u00E1 disponible.
08006.C.8=org.apache.derby.jdbc.EmbeddedDriver no se ha registrado con el gestor de controladores JDBC
X0X0D.S=Longitud de matriz de columna no v\u00E1lida ''{0}''. Para devolver claves generadas, la matriz de columna debe ser de longitud 1 y contener solo la columna de identidad.
22005.S.1=No se ha podido convertir un valor del tipo ''{0}'' al tipo ''{1}'' \: la codificaci\u00F3n no est\u00E1 soportada.
58016.C=No est\u00E1 soportado el par\u00E1metro DDM 0x{0}. La conexi\u00F3n se ha terminado.
08006.C.6=Se ha intentado materializar por completo datos lob demasiado grandes para JVM. La conexi\u00F3n se ha terminado.
08006.C.5=No hay suficientes datos durante la lectura desde la red\: se esperaba un m\u00EDnimo de {0} y s\u00F3lo se han recibido {1} bytes. La conexi\u00F3n se ha terminado.
08006.C.4=Se ha producido un error durante un restablecimiento de conexi\u00F3n diferido y la conexi\u00F3n se ha terminado. Consulte las excepciones encadenadas para obtener m\u00E1s informaci\u00F3n.
08006.C.3=Se ha detectado un error de comunicaciones\: {0}.
08006.C.2=SocketException\: ''{0}''
08006.C.1=Se ha producido un error durante el restablecimiento de la conexi\u00F3n y \u00E9sta se ha terminado. Consulte las excepciones encadenadas para obtener m\u00E1s informaci\u00F3n.
0A000.S.7=El tipo de dato ''{0}'' no est\u00E1 soportado.
0A000.S.5=El mecanismo de seguridad ''{0}'' no est\u00E1 soportado.
0A000.S.4=cancel() no est\u00E1 soportado por el servidor.
XJ015.M=Cierre del sistema Derby.
0A000.S.3=La propiedad resultSetHoldability {0} no est\u00E1 soportada
0A000.S.2=El m\u00E9todo JDBC {0} no est\u00E1 soportado por el servidor. Actualice el servidor.
XJ011.S=No se puede transferir un valor nulo como nombre de SAVEPOINT.
08001.C.14=No se ha podido establecer una conexi\u00F3n porque el nombre de servidor (SRVNAM) tiene una longitud de cero o es mayor que el m\u00E1ximo permitido por el protocolo de red.
0A000.S.1=El m\u00E9todo JDBC a\u00FAn no se ha implantado.
08001.C.13=No se ha podido establecer una conexi\u00F3n porque el nombre externo (EXTNAM) tiene una longitud de cero o es mayor que el m\u00E1ximo permitido por el protocolo de red.
XJ108.S=Tama\u00F1o de bloque no v\u00E1lido
08001.C.12=No se ha podido establecer una conexi\u00F3n porque la contrase\u00F1a tiene una longitud de cero o es mayor que el m\u00E1ximo permitido por el protocolo de red.
08001.C.11=No se ha podido establecer una conexi\u00F3n porque el ID de usuario tiene una longitud de cero o es mayor que el m\u00E1ximo permitido por el protocolo de red.
08001.C.10=No se ha podido establecer una conexi\u00F3n porque el token de seguridad es mayor que el m\u00E1ximo permitido por el protocolo de red.
XJ104.S=La longitud de clave compartida no es v\u00E1lida\: {0}.
XN002.U=No se ha devuelto SECTKN.
XJ068.S=S\u00F3lo est\u00E1n permitidos executeBatch y clearBatch en mitad de un lote.
XJ100.S=La escala proporcionada por el m\u00E9todo registerOutParameter no coincide con el m\u00E9todo setter. Puede que se pierda la precisi\u00F3n.
XJ064.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para setFetchDirection(int direction).
0A000.C.6=El comando DRDA {0} no est\u00E1 implantado actualmente. La conexi\u00F3n se ha terminado.
XJ008.S=No se ha podido realizar un rollback o liberar un punto de grabaci\u00F3n en modo de confirmaci\u00F3n autom\u00E1tica.
XJ125.S=S\u00F3lo se debe llamar a este m\u00E9todo en objetos ResultSet que sean desplazables (tipo TYPE_SCROLL_INSENSITIVE).
XJ05C.S=No se puede definir la constante de retenci\u00F3n ResultSet.HOLD_CURSORS_OVER_COMMIT para una transacci\u00F3n global.
XJ121.S=Operaci\u00F3n no v\u00E1lida en la posici\u00F3n actual del cursor.
XJ085.S=El flujo ya se ha le\u00EDdo, se ha alcanzado el fin de archivo y no se puede volver a utilizar.
XJ004.C=No se ha encontrado la base de datos ''{0}''.
XJ214.S=Se ha producido un error de E/S al llamar a free() en un CLOB o BLOB.
22003.S.3=Se ha producido un desbordamiento durante la conversi\u00F3n del tipo de dato num\u00E9rico de ''{0}'' a {1}.
08004.C.9=Falta el permiso para que usuario ''{0}'' cierre el sistema [{1}].
22003.S.2=El decimal s\u00F3lo puede tener un m\u00E1ximo de 31 d\u00EDgitos.
08004.C.8=El usuario ''{0}'' no puede emitir una operaci\u00F3n de replicaci\u00F3n en la base de datos ''{1}''. S\u00F3lo el propietario de la base de datos puede realizar esta operaci\u00F3n.
22003.S.1=El a\u00F1o ({0}) excede el m\u00E1ximo ''{1}''.
08004.C.7=La conexi\u00F3n con la base de datos ''{0}'' ha sido rechazada porque est\u00E1 en modo esclavo de replicaci\u00F3n.
08004.C.6=El usuario ''{0}'' no puede realizar una actualizaci\u00F3n completa de la base de datos ''{1}''. S\u00F3lo el propietario de la base de datos puede realizar esta operaci\u00F3n.
08004.C.5=El usuario ''{0}'' no puede volver a cifrar la base de datos ''{1}''. S\u00F3lo el propietario de la base de datos puede realizar esta operaci\u00F3n.
08004.C.4=El usuario ''{0}'' no puede cerrar la sesi\u00F3n de la base de datos ''{1}''. S\u00F3lo el propietario de la base de datos puede realizar esta operaci\u00F3n.
08004.C.3=Conexi\u00F3n de base de datos rechazada.
08004.C.2=Se ha rechazado la conexi\u00F3n porque no se ha encontrado la base de datos {0}.
XJ081.S=Se ha transferido el valor ''{0}'' no v\u00E1lido como par\u00E1metro ''{1}'' al m\u00E9todo ''{2}''
08004.C.1=Se ha producido un fallo de autenticaci\u00F3n de conexi\u00F3n. Motivo\: {0}.
XJ210.S=No se ha encontrado el nombre del m\u00F3dulo de carga para el procedimiento almacenado en el servidor.
XJ057.S=No se puede confirmar una transacci\u00F3n global mediante la conexi\u00F3n, el proceso de confirmaci\u00F3n debe ir a trav\u00E9s de la interfaz XAResource.
XCL08.S=El cursor ''{0}'' no est\u00E1 en una fila.
XJ081.C=Se han especificado atributos de creaci\u00F3n/restauraci\u00F3n/recuperaci\u00F3n que entran en conflicto.
J136=Exist\u00EDa una transacci\u00F3n XA asociada a la conexi\u00F3n que se cierra. Se va a realizar un rollback en la transacci\u00F3n. El Xid de transacci\u00F3n es {0}.
23502=La columna ''{0}'' no acepta un valor NULL.
J135=Se ha producido un timeout en la transacci\u00F3n XA y se va a realizar un rollback. El Xid de transacci\u00F3n es {0}.
J134=No se permiten valores negativos para la propiedad maxStatements\: {0}
J133=Contrase\u00F1a de usuario para la conexi\u00F3n
J132=Nombre de usuario para la conexi\u00F3n
J131=Se ha detectado un error de protocolo (error de sintaxis de la flujo de datos). Motivo\: 0x{0}. Es posible que se haya intentado abrir una conexi\u00F3n no cifrada con un servidor SSL activado.
J130=Se ha detectado un error de protocolo (error de descripci\u00F3n de FDOCA no v\u00E1lida).
22007.S.181=La sintaxis de la representaci\u00F3n de cadena de un valor de fecha y hora es incorrecta.
XJ025.S=El flujo de entrada no puede tener una longitud negativa.
2D521.S.2=Rollback o confirmaci\u00F3n no v\u00E1lida para el entorno de ejecuci\u00F3n de la aplicaci\u00F3n.
2D521.S.1=setAutoCommit(true) no v\u00E1lido durante una transacci\u00F3n global.
22028=La cadena excede la longitud m\u00E1xima de {0}.
XJ021.S=El tipo no est\u00E1 soportado.
XJ118.S=Se ha solicitado un lote de consultas en una sentencia que no es de consulta.
58009.C.9=Excepci\u00F3n de protocolo de red\: la longitud PKGNAMCSN, {0}, no es v\u00E1lida en SQLAM {1}. La conexi\u00F3n se ha terminado.
XN016.S=Se ha encontrado una excepci\u00F3n al intentar verificar la longitud del flujo especificado por el par\u00E1metro \#{0}. La excepci\u00F3n ten\u00EDa el siguiente mensaje\: {1}.
58009.C.8=Excepci\u00F3n de protocolo de red\: la longitud de SCLDTA, {0}, no es v\u00E1lida para PKGID. La conexi\u00F3n se ha terminado.
58009.C.7=Excepci\u00F3n de protocolo de red\: la longitud de SCLDTA, {0}, no es v\u00E1lida para RDBCOLID. La conexi\u00F3n se ha terminado.
J129=Se ha emitido un comando de apertura de consulta para una consulta que ya estaba abierta
XJ114.S=Nombre de cursor no v\u00E1lido ''{0}''
J128=El cursor no est\u00E1 abierto
J126=Se ha detectado un error de protocolo de conversaci\u00F3n. Motivo\: 0x{0}.
J125=Se ha detectado un error de no coincidencia de descriptor de datos.
XJ04B.S=El lote no puede contener un comando que intente devolver un juego de resultados.
07000=Al menos un par\u00E1metro de la sentencia actual no est\u00E1 inicializado.
J124=El comando de acceso a base de datos relacional (ACCRDB) no se puede emitir porque ya se ha accedido actualmente a la base de datos
XN012.S=En plataformas {0}, XA soporta la versi\u00F3n {1} y superiores, \u00E9sta es la versi\u00F3n {2}
J123=El comando solicitado ha encontrado una condici\u00F3n no estructurada y espec\u00EDfica de la implantaci\u00F3n para la que no hab\u00EDa ning\u00FAn mensaje estructurado (puede encontrar m\u00E1s informaci\u00F3n en el archivo derby.log del servidor)
08003.C.3=La conexi\u00F3n f\u00EDsica subyacente est\u00E1 anticuada o cerrada.
J122=Se ha emitido un comando que solicita servicios de la base de datos antes del comando que solicita acceso a la base de datos (ACCRDB)
08003.C.2=El m\u00E9todo lob llamado despu\u00E9s de una conexi\u00F3n se ha cerrado
J121=El usuario no tiene autorizaci\u00F3n para acceder a la base de datos
08003.C.1=getConnection() no v\u00E1lido en PooledConnection cerrado.
J120=Error de conexi\u00F3n no especificado
XJ110.S=El nombre de tabla primaria no puede ser nulo
XJ078.S=El desplazamiento ''{0}'' es inferior a cero o es demasiado grande para el BLOB/CLOB actual.
XJ207.S=No se puede utilizar el m\u00E9todo executeQuery para la actualizaci\u00F3n.
24501.S=El cursor identificado no est\u00E1 abierto.
X0X95.S=No se puede realizar la operaci\u00F3n ''{0}'' en el objeto ''{1}'' porque existe un ResultSet abierto que depende de ese objeto.
22018=Formato de cadena de caracteres no v\u00E1lido para el tipo {0}.
XJ074.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para Statement.setQueryTimeout(int seconds).
XJ203.S=El nombre de cursor ''{0}'' ya est\u00E1 en uso
XJ070.S=Se ha transferido un argumento de posici\u00F3n negativo o cero ''{0}'' en un m\u00E9todo Blob o Clob.
J118=Contrase\u00F1a caducada
J117=Falta SECTKN en ACCSEC cuando es necesario o no es v\u00E1lido
J116=Error de servicio de seguridad local para una operaci\u00F3n que no se puede reintentar.
J115=Contrase\u00F1a nueva no v\u00E1lida
J114=ID de usuario revocado
J113=ID de usuario o contrase\u00F1a no v\u00E1lidos
J112=Falta el ID de usuario
58015.C=No est\u00E1 soportado el objeto DDM 0x{0}. La conexi\u00F3n se ha terminado.
J111=Falta la contrase\u00F1a
J110=Mecanismo de seguridad no soportado
XJ042.S=''{0}'' no es un valor v\u00E1lido para la propiedad ''{1}''.
XJ018.S=El nombre de columna no puede ser nulo.
08006.D=Cierre de la base de datos ''{0}''.
08006.C=Se ha encontrado un error de protocolo de red y se ha terminado la conexi\u00F3n\: {0}
22005=Se ha intentado obtener un valor de datos de tipo ''{0}'' de un valor de datos de tipo ''{1}''.
XJ014.S=No hay nombre para SAVEPOINT sin nombre.
22003=El valor resultante queda fuera del rango para el tipo de dato {0}.
XJ099.S=El objeto lector/flujo no contiene caracteres de longitud
XN009.S=Error al obtener la longitud del objeto BLOB/CLOB, a continuaci\u00F3n se obtiene una excepci\u00F3n.
XJ010.S=No se puede emitir un SAVEPOINT cuando la validaci\u00F3n autom\u00E1tica est\u00E1 activada.
J109=Se ha detectado una configuraci\u00F3n de cliente TCP/IP incorrecto. No se ha podido determinar la direcci\u00F3n IP del host local\: ''{0}''. Aseg\u00FArese de que la m\u00E1quina cliente tiene configurada correctamente una direcci\u00F3n IP.
XJ107.S=Relleno incorrecto
J108=El gestor de seguridad no permite acceder a la propiedad del sistema {0}.
XCY00.S=Valor no v\u00E1lido para la propiedad ''{0}''\=''{1}''.
J107=Error para el elemento del lote \#
J105=La precisi\u00F3n excede de 31 d\u00EDgitos.
J104=El objeto ya est\u00E1 cerrado.
XJ095.S=Fallo al intentar ejecutar una acci\u00F3n con privilegios.
J103=Se ha generado una excepci\u00F3n al cerrar el servidor de red. {0}
J102=Se ha generado una excepci\u00F3n al iniciar el servidor de red. {0}
J101=No se puede cargar la clase del servidor de red, {0}. {1} Compruebe la integridad del archivo derbynet.jar.
J100=No se ha encontrado la clase del servidor de red, {0}. La classpath debe contener derbynet.jar.
XJ103.S=El nombre de tabla no puede ser nulo
XN001.S=No se permite un restablecimiento de la conexi\u00F3n dentro de una unidad de trabajo.
XJ091.S=Argumento no v\u00E1lido\: el \u00EDndice de par\u00E1metro {0} no es un par\u00E1metro OUT o INOUT.
XJ067.S=El puntero de texto SQL es nulo.
XJ063.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para Statement.setMaxRows(int maxRows). El valor del par\u00E1metro debe ser >\= 0.
XCL18.S=El valor LOB o flujo no se puede recuperar m\u00E1s de una vez
XCL14.S=La posici\u00F3n de la columna ''{0}'' est\u00E1 fuera de rango. El n\u00FAmero de columnas de esta sentencia ResultSet es ''{1}''.
08001.C.9=No se ha podido establecer una conexi\u00F3n porque el nombre de la base de datos ''{0}'' es mayor que la longitud m\u00E1xima permitida por el protocolo de red.
08001.C.8=La contrase\u00F1a no puede ser nula.
08001.C.7=El ID de usuario no puede ser nulo.
08001.C.6=La longitud de la contrase\u00F1a ({0}) est\u00E1 fuera del rango entre 1 y {1}.
08001.C.5=La longitud del ID de usuario ({0}) est\u00E1 fuera del rango entre 1 y {1}.
08001.C.4=No se ha podido abrir el flujo en el socket\: ''{0}''.
08001.C.3=SocketException\: ''{0}''
08001.C.2={0}\: Error al conectarse al servidor {1} en el puerto {2} con el mensaje {3}.
XJ128.S=No se ha podido desajustar para ''{0}''
08001.C.1=La propiedad Derby DataSource {0} necesaria no est\u00E1 definida.
XJ124.S=Columna no actualizable.
08004=Conexi\u00F3n rechazada\: {0}
08003=Sin conexi\u00F3n actual.
08000=Conexi\u00F3n cerrada por una interrupci\u00F3n desconocida.
XJ088.S=Operaci\u00F3n no v\u00E1lida\: se ha llamado a wasNull() sin datos recuperados.
XJ217.S=El localizador proporcionado para este CLOB/LOB no es v\u00E1lido.
XJ084.U=La columna no corresponde a una columna de la tabla base. No se puede emitir ''{0}'' en esta columna.
XJ05B.C=El atributo de JDBC ''{0}'' tiene un valor ''{1}'' no v\u00E1lido, los valores v\u00E1lidos son ''{2}''.
XJ080.S=La sentencia de ejecuci\u00F3n USING ha transferido {0} par\u00E1metros en lugar de {1}.
XJ056.S=No puede definir la activaci\u00F3n de la confirmaci\u00F3n autom\u00E1tica si est\u00E1 en una conexi\u00F3n XA.
XJ213.C=La propiedad de conexi\u00F3n traceLevel no tiene un formato v\u00E1lido para un n\u00FAmero.
XCL31.S=Sentencia cerrada.
J031=Ordenaci\u00F3n para tipos de dato de caracteres
J030=Ruta de acceso de copia de seguridad para restaurar base de datos a partir de copia de seguridad
22011.S.1=El rango especificado para la subcadena con el desplazamiento {0} y la longitud {1} est\u00E1 fuera de rango para la cadena\: {2}.
XN019.S=Error al ejecutar {0}, el servidor ha devuelto {1}.
XJ028.C=La URL ''{0}'' no tiene el formato correcto.
XJ020.S=El tipo de objeto no es convertible al tipo ''{0}'', valor java.sql.Types no v\u00E1lido o el objeto es nulo.
XJ117.S=El proceso por lotes de consultas no est\u00E1 permitido seg\u00FAn el cumplimiento con J2EE.
XN015.S=Error de protocolo de red\: el tama\u00F1o especificado de InputStream, par\u00E1metro \#{0}, es inferior a la longitud real de InputStream.
XJ113.S=No se ha podido abrir el archivo {0} \: {1}
J029=Ruta de acceso de copia de seguridad para crear base de datos a partir de copia de seguridad
J028=Ruta de acceso de copia de seguridad para la recuperaci\u00F3n en avance
J025=Ruta de acceso del directorio de log
XN011.S=La longitud del nombre de procedimiento {0} no est\u00E1 dentro del rango v\u00E1lido entre 1 y {1}.
J023=Contrase\u00F1a de usuario
J022=Nombre de usuario
J021=Territorio de la base de datos
XJ077.S=Se ha obtenido una excepci\u00F3n al intentar leer el primer byte/car\u00E1cter del patr\u00F3n BLOB/CLOB mediante getBytes/getSubString.
J020=Clave de cifrado secreta
XJ206.S=El texto SQL ''{0}'' no contiene se\u00F1ales.
XJ073.S=Los datos de este BLOB o CLOB ya no est\u00E1n disponibles. La transacci\u00F3n de BLOB / CLOB se puede confirmar, su conexi\u00F3n se ha cerrado o se ha liberado.
XJ202.S=Nombre de cursor no v\u00E1lido ''{0}''.
0A000.S=Funci\u00F3n no implantada\: {0}.
XJ045.S=Se ha pasado a un nivel de aislamiento no v\u00E1lido o no soportado (actualmente), ''{0}'', a Connection.setTransactionIsolation(). Los valores soportados actualmente son java.sql.Connection.TRANSACTION_SERIALIZABLE, java.sql.Connection.TRANSACTION_REPEATABLE_READ, java.sql.Connection.TRANSACTION_READ_COMMITTED y java.sql.Connection.TRANSACTION_READ_UNCOMMITTED.
J019=Clave de cifrado externa
J018=Longitud de clave de cifrado
J017=Algoritmo de cifrado
J016=Proveedor de servicio de cifrado
J013=Actualizar base de datos
58014.C=No est\u00E1 soportado el comando DDM 0x{0}. La conexi\u00F3n se ha terminado.
XJ049.C=Se han especificado atributos de creaci\u00F3n que entran en conflicto.
J010=Cifrar base de datos en disco
XJ017.S=No se permite el comando de punto de grabaci\u00F3n dentro de un c\u00F3digo de disparador.
58010.C=Se ha encontrado un error de protocolo de red. No se ha podido establecer una conexi\u00F3n debido a que el gestor {0} en el nivel {1} no est\u00E1 soportado en el servidor. 
XJ013.S=No hay identificador para los SAVEPOINT con nombre.
XJ041.C=No se ha podido crear la base de datos ''{0}'', consulte la excepci\u00F3n siguiente para obtener m\u00E1s informaci\u00F3n.
XN008.S=El proceso de consulta se ha terminado debido a un error en el servidor.
XJ098.S=El valor de claves generadas autom\u00E1ticamente {0} no es v\u00E1lido
42622=El nombre ''{0}'' es demasiado largo. La longitud m\u00E1xima es ''{1}''.
J008=Sin detalles
XJ106.S=No existe dicho relleno 
J007=Crear base de datos
J006=Anular registro de AutoloadedDriver
J005=Cerrar Derby
J004=Identidad de base de datos
J003={0}\: cerrando motor de Derby
XJ090.S=Par\u00E1metro no v\u00E1lido\: el calendario es nulo.
XJ066.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para Statement.setMaxFieldSize(int max).
3B502.S=Se ha especificado una versi\u00F3n o la realizaci\u00F3n de un rollback en un punto de grabaci\u00F3n, pero no existe ning\u00FAn punto de grabaci\u00F3n.
XJ062.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para ResultSet.setFetchSize(int rows).
XCL13.S=La posici\u00F3n del par\u00E1metro ''{0}'' est\u00E1 fuera de rango. El n\u00FAmero de par\u00E1metros de esta sentencia preparada es ''{1}''.
24000=Estado del cursor no v\u00E1lido\: sin fila actual.
XJ030.S=No se puede definir la activaci\u00F3n de la confirmaci\u00F3n autom\u00E1tica si est\u00E1 en una conexi\u00F3n anidada.
08004.C.13=El nombre de usuario o la contrase\u00F1a es nula o tiene una longitud 0.
08004.C.12=Se ha producido un fallo en la autenticaci\u00F3n de la conexi\u00F3n. Las credenciales proporcionadas no son v\u00E1lidas o la base de datos utiliza un esquema de cifrado de contrase\u00F1as incompatible con el mecanismo de seguridad de contrase\u00F1as seguras de sustituci\u00F3n. Si este error se inici\u00F3 despu\u00E9s de la actualizaci\u00F3n, consulte la nota t\u00E9cnica obre la versi\u00F3n de DERBY-4483 para consultar las posibles opciones.
08004.C.11=Falta el permiso para que el usuario ''{0}'' cree la base de datos ''{1}'' [{2}].
08004.C.10=No se pueden comprobar los permisos del sistema para crear la base de datos ''{0}'' [{1}].
XJ123.S=Se debe llamar a este m\u00E9todo para actualizar los valores de la fila actual o de la fila de inserci\u00F3n.
XN021.S=Un objeto de tipo {0} no se puede convertir en un objeto de tipo {1}.
XJ087.S=La suma de la posici\u00F3n(''{0}'') y la longitud(''{1}'') es mayor que el tama\u00F1o del LOB m\u00E1s uno.
XJ216.S=La longitud de este BLOB/CLOB a\u00FAn no est\u00E1 disponible. Cuando se accede a BLOB o CLOB como un flujo, la longitud no est\u00E1 disponible hasta que se ha procesado el flujo completo.
01J13=El n\u00FAmero de filas devueltas ({0}) es demasiado grande para un entero; el valor devuelto se truncar\u00E1.
XJ083.U=''{0}'' no permitido porque el ResultSet no es un ResultSet actualizable. 
01J12=No se ha podido obtener el texto del mensaje del servidor. Consulte la siguiente excepci\u00F3n. El procedimiento almacenado SYSIBM.SQLCAMESSAGE no est\u00E1 instalado en el servidor. P\u00F3ngase en contacto con el administrador de la base de datos.
01J10=Los juegos de resultados sensibles al desplazamiento no est\u00E1n soportados por el servidor; se realizar\u00E1 una nueva asignaci\u00F3n al cursor de s\u00F3lo avance
XJ212.S=Sintaxis de atributo no v\u00E1lida\: {0}
XJ059.S=No se puede cerrar una conexi\u00F3n mientras siga activa una transacci\u00F3n global.
01J08=No se ha podido abrir el tipo resultSet {0}. Se ha abierto el tipo ResultSet {1}.
01J07=ResultSetHoldability est\u00E1 restringido a ResultSet.CLOSE_CURSORS_AT_COMMIT para una transacci\u00F3n global.
01J06=No se puede actualizar ResultSet. La consulta no es v\u00E1lida para generar un ResultSet actualizable.
XJ023.S=El flujo de entrada no conten\u00EDa la cantidad exacta de datos que la longitud solicitada.
XBM0N.D=No se ha podido registrar el controlador JDBC con java.sql.DriverManager. Consulte la excepci\u00F3n siguiente para obtener m\u00E1s informaci\u00F3n. 
XN018.S=Error de protocolo de red\: el tama\u00F1o especificado del lector par\u00E1metro \#{0}, es inferior a la longitud real de InputStream.
58009.C.21=Excepci\u00F3n de protocolo de red\: la longitud de SCLDTA, {0}, no es v\u00E1lida para RDBNAM. La conexi\u00F3n se ha terminado.
58009.C.20=Excepci\u00F3n de protocolo de red\: s\u00F3lo uno de NVCM o NVCS puede ser no nulo. La conexi\u00F3n se ha terminado.
XJ116.S=No se pueden agregar m\u00E1s de {0} comandos a un \u00FAnico lote.
XN014.S=Se ha encontrado una excepci\u00F3n al leer en el flujo especificado por el par\u00E1metro \#{0}. Los datos restantes esperados por el servidor se han rellenado con 0x0. La excepci\u00F3n ten\u00EDa el mensaje siguiente\: {1}.
X0Y78.S.2=Se ha llamado a {0}.executeQuery() pero no se ha devuelto ning\u00FAn juego de resultados. Utilice {1}.executeUpdate() si no se trata de consultas.
XJ112.S=Se ha encontrado una excepci\u00F3n de seguridad, consulte la excepci\u00F3n siguiente para obtener m\u00E1s informaci\u00F3n.
X0Y78.S.1=No se puede llamar a {0}.executeQuery() porque se han devuelto m\u00FAltiples juegos de resultados. Utilice {1}.execute() para obtener m\u00FAltiples resultados.
XJ209.S=El proceso almacenado necesario no est\u00E1 instalado en el servidor.
XN010.S=El nombre del procedimiento no puede ser nulo.
XJ076.S=El argumento de posici\u00F3n ''{0}'' excede el tama\u00F1o del BLOB/CLOB.
58009.C.19=Excepci\u00F3n de protocolo de red\: no se ha devuelto SECTKN. La conexi\u00F3n se ha terminado.
58009.C.18=Excepci\u00F3n de protocolo de red\: FDOCA LID no v\u00E1lido. La conexi\u00F3n se ha terminado.
58009.C.17=Excepci\u00F3n de protocolo de red\: se ha alcanzado anticipadamente el final del flujo al leer InputStream, par\u00E1metro \#{0}. La conexi\u00F3n se ha terminado.
58009.C.16=Excepci\u00F3n de protocolo de red\: DSS encadenado con el mismo ID al final del mismo an\u00E1lisis de cadena de ID. La conexi\u00F3n se ha terminado.
58009.C.15=Excepci\u00F3n de protocolo de red\: la longitud de DSS no es 0 al final del mismo an\u00E1lisis de cadena de ID. La conexi\u00F3n se ha terminado.
58009.C.14=Excepci\u00F3n de protocolo de red\: la pila de recopilaci\u00F3n no est\u00E1 vac\u00EDa al final del mismo an\u00E1lisis de cadena de ID. La conexi\u00F3n se ha terminado.
58009.C.13=Excepci\u00F3n de protocolo de red\: la recopilaci\u00F3n DDM contiene menos de 4 bytes de datos. La conexi\u00F3n se ha terminado.
42X74=Sintaxis de la sentencia CALL no v\u00E1lida.
58009.C.12=Excepci\u00F3n de protocolo de red\: el punto de c\u00F3digo real, {0}, no coincide con el punto de c\u00F3digo esperado, {1}. La conexi\u00F3n se ha terminado.
XJ072.S=Se ha transferido un patr\u00F3n o searchStr nulo a un m\u00E9todo de posici\u00F3n BLOB o CLOB.
58009.C.11=La conexi\u00F3n se ha terminado porque la codificaci\u00F3n no est\u00E1 soportada.
58009.C.10=Excepci\u00F3n de protocolo de red\: s\u00F3lo una longitud de VCM o VCS puede ser mayor que 0. La conexi\u00F3n se ha terminado.
58017.C=No est\u00E1 soportado el valor del par\u00E1metro DDM 0x{0}. Puede que una variable de host de entrada no est\u00E9 en el rango soportado por el servidor. La conexi\u00F3n se ha terminado.
XJ044.S=''{0}'' no es una escala v\u00E1lida.
25001=No se puede cerrar una conexi\u00F3n mientras todav\u00EDa siga activa una transacci\u00F3n.
08006.D.1=Base de datos ''{0}'' borrada.
XJ048.C=Se han especificado atributos de inicio que entran en conflicto\: {0}
XJ016.S=El m\u00E9todo ''{0}'' no est\u00E1 permitido en una sentencia preparada.
XJ012.S=''{0}'' ya est\u00E1 cerrado.
XCY02.S=El cambio de propiedad solicitado no est\u00E1 soportado ''{0}''\=''{1}''.
XJ040.C=No se ha podido iniciar la base de datos ''{0}'' con el cargador de clases {1}, consulte la excepci\u00F3n siguiente para obtener m\u00E1s informaci\u00F3n.
XJ097.S=No se puede realizar un rollback o liberar un punto de grabaci\u00F3n que no haya sido creado por esta conexi\u00F3n.
XJ105.S=La clave DES tiene una longitud incorrecta; longitud esperada {0}, longitud obtenida {1}.
XIE08.S=No existe una columna denominada\: {0}. 
XJ093.S=La longitud de BLOB/CLOB, {0}, es demasiado grande. La longitud no puede exceder de {1}.
XJ069.S=No se permiten m\u00E9todos SetXXX en el caso de la sentencia de ejecuci\u00F3n USING.
XJ065.S=Valor del par\u00E1metro no v\u00E1lido ''{0}'' para Statement.setFetchSize(int rows).
X0Y79.S=No se puede llamar a Statement.executeUpdate() con una sentencia que devuelve un ResultSet.
42ZA1=SQL no v\u00E1lido en el lote\: ''{0}''.
XJ061.S=El m\u00E9todo ''{0}'' s\u00F3lo est\u00E1 permitido en cursores de desplazamiento.
XCL16.S=ResultSet no se ha abierto. La operaci\u00F3n ''{0}'' no est\u00E1 permitida. Verifique que la confirmaci\u00F3n autom\u00E1tica est\u00E9 desactivada.
XCL12.S=Se ha intentado ubicar un valor de datos de tipo ''{0}'' en un valor de datos de tipo ''{1}''.
XJ009.S=Es necesario utilizar CallableStatement con llamadas de procedimientos almacenados o utilizar par\u00E1metros de salida\: {0}
XJ126.S=No se debe llamar a este m\u00E9todo en cursores din\u00E1micos sensibles.
XJ122.S=No se han llamado a m\u00E9todos updateXXX en esta fila.
XJ001.U=Excepci\u00F3n de Java\: ''{1}\: {0}''.
XN020.S=Error al canalizar o anular la canalizaci\u00F3n de un tipo definido por el usuario\: {0}
XJ086.S=No se puede llamar a este m\u00E9todo mientras el cursor no est\u00E9 en la fila de inserci\u00F3n o si la simultaneidad de este objeto ResultSet sea CONCUR_READ_ONLY.
XJ215.S=No puede llamar a otro m\u00E9todo java.sql.Clob o java.sql.Blob despu\u00E9s de haber llamado al m\u00E9todo free() ni despu\u00E9s de haber confirmado o realizado un rollback en la transacci\u00F3n de Blob/Clob.
XJ082.U=No se permiten los valores BLOB/CLOB como receptor o par\u00E1metros de m\u00E9todo.
57017.C=No existe ninguna conversi\u00F3n disponible para la p\u00E1gina de c\u00F3digo de origen, {0}, a la p\u00E1gina de c\u00F3digo de destino, {1}. La conexi\u00F3n se ha terminado.
XJ211.S=Se ha producido una excepci\u00F3n de ruptura de cadena no recuperable durante el proceso por lotes. El lotes termina de manera no at\u00F3mica.
XJ058.S=No se puede realizar un rollback de una transacci\u00F3n global mediante la conexi\u00F3n, el proceso de confirmaci\u00F3n debe ir a trav\u00E9s de la interfaz XAResource.
42X30=No se ha encontrado el cursor ''{0}''. Verifique que la confirmaci\u00F3n autom\u00E1tica est\u00E1 desactivada.
XJ050.U=La base de datos necesita actualizarse desde la versi\u00F3n {0}, defina el atributo ''upgrade\=true'' en el URL de conexi\u00F3n JDBC para permitir la actualizaci\u00F3n a la versi\u00F3n {1}.
